import 'package:qapp/data/azkar/azkar_data.dart';

final List<AzkarItem> azkarMorning = [
  AzkarItem(
    category: "أذكار الصباح",
    count: "1",
    description: "",
    reference: "",
    content:
        "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "1",
    description: "من قالها موقناً بها حين يصبح ومات من يومه دخل الجنة.",
    reference: "",
    content:
        "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، "
        "وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، "
        "أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ "
        "وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "3",
    description: "",
    reference: "",
    content:
        "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ نَبِيّـاً.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "4",
    description: "",
    reference: "",
    content:
        "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك "
        "وَمَلَائِكَتَكَ وَجَمـيعَ خَلْـقِك ، "
        "أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك "
        "وَأَنَّ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "7",
    description: "",
    reference: "",
    content:
        "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ "
        "وَهُوَ رَبُّ العَرْشِ العَظـيم.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "3",
    description: "",
    reference: "",
    content:
        "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ "
        "في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "1",
    description: "",
    reference: "",
    content:
        "اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ "
        "وَإِلَـيْكَ النُّـشُور.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "1",
    description: "",
    reference: "",
    content:
        "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، "
        "وَعَلَى كَلِمَةِ الإِخْلاَصِ، "
        "وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ ﷺ "
        "وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً "
        "وَمَا كَانَ مِنَ المُشْرِكِينَ.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "1",
    description: "آية الكرسي: من قالها حين يصبح أجير من الجن حتى يمسي.",
    reference: "",
    content:
        "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "3",
    description: "تكفيه من كل شيء.",
    reference: "",
    content:
        "قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌ.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "3",
    description: "تكفيه من كل شيء.",
    reference: "",
    content:
        "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "3",
    description: "تكفيه من كل شيء.",
    reference: "",
    content:
        "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "3",
    description: "",
    reference: "",
    content:
        "اللّهُـمَّ عافِـني في بَدَنـي، اللّهُـمَّ عافِـني في سَمْـعي، اللّهُـمَّ عافِـني في بَصَـري، لا إلهَ إلاّ أَنْـتَ.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "3",
    description: "",
    reference: "",
    content:
        "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "1",
    description: "",
    reference: "",
    content:
        "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "1",
    description: "",
    reference: "",
    content:
        "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ أَصْلِحْ لِي شَأْنِي كُلَّهُ وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "1",
    description: "",
    reference: "",
    content:
        "اللّهُـمَّ عالِـمَ الغَـيْبِ وَشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "3",
    description: "",
    reference: "",
    content:
        "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "1",
    description: "",
    reference: "",
    content: "اللهم إني أسألك علماً نافعاً، ورزقاً طيباً، وعملاً متقبلاً.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "100",
    description: "حطت خطاياه وإن كانت مثل زبد البحر.",
    reference: "",
    content: "سُبْحَانَ اللهِ وَبِحَمْدِهِ.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "100",
    description: "",
    reference: "",
    content: "أَسْتَغْفِرُ اللهَ وَأَتُوبُ إِلَيْهِ.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "10",
    description: "أدركته شفاعتي يوم القيامة.",
    reference: "",
    content: "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبِيِّنَا مُحَمَّدٍ.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "100",
    description:
        "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزاً من الشيطان.",
    reference: "",
    content:
        "لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شَـريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْـد، وهُوَ على كُلّ شَيءٍ قَدير.",
  ),
  AzkarItem(
    category: "أذكار الصباح",
    count: "1",
    description: "",
    reference: "",
    content: "سُبْحَانَ اللهِ الْعَظِيمِ وَبِحَمْدِهِ.",
  ),
];
